app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `id_user` > '0'
SELECT COUNT(*) AS `numrows`
FROM `event`
WHERE `id_event` > '0'
---
    public function index()
    {
        // count customer
        $customerModel = new AdminAll();
        $customer = $customerModel->table('user');
        $countcustomer = $customer->where('id_user >', '0')->countAllResults();

        // count event
        $eventModel = new MyEventMod();
        $event = $eventModel->table('event');
        $countevent = $event->where('id_event >', '0')->countAllResults();